using System.ComponentModel.DataAnnotations;

namespace SRS.Domain.Enums
{
    public enum PublicationType
    {
        [Display(Name = "Монографія у закордонному видавництві")]
        Монографія_У_Закордонному_Видавництві,
        [Display(Name = "Монографія у вітчизняному видавництві")]
        Монографія_У_Вітчизняному_Видавництві,
        [Display(Name = "Монографії які індексуються у міжнародних наукометричних баз даних Web of Science, Scopus")]
        Монографія_У_Наукометричних_Базах,
        [Display(Name = "Монографії які опубліковані за кордоном мовами країн ОЕСР та / або ЄС")]
        Монографія_Опубліковані_За_Кордоном,
        [Display(Name = "Монографії, які опубліковані в Україні")]
        Монографія_Опубліковані_В_Україні,
        [Display(Name = "Розділ монографії у закордонному видавництві")]
        Розділ_монографії_У_Закордонному_Видавництві,
        [Display(Name = "Розділ монографії у вітчизняному видавництві")]
        Розділ_монографії_У_Вітчизняному_Видавництві,
        [Display(Name = "Розділи монографії які індексуються у міжнародних наукометричних баз даних Web of Science, Scopus")]
        Розділ_монографії_У_Наукометричних_Базах,
        [Display(Name = "Розділи монографії які опубліковані за кордоном мовами країн ОЕСР та / або ЄС")]
        Розділ_монографії_Опубліковані_За_Кордоном,
        [Display(Name = "Розділи монографії, які опубліковані в Україні")]
        Розділ_монографії_Опубліковані_В_Україні,
        [Display(Name = "Інші монографії")]
        Інші_монографії,
        [Display(Name = "Підручник")]
        Підручник,
        [Display(Name = "Навчальний посібник")]
        Навчальний_Посібник,
        [Display(Name = "Стаття у виданні, яке має імпакт-фактор")]
        Стаття_В_Виданнях_які_мають_імпакт_фактор,
        [Display(Name = "Стаття в іншому виданні, яке включене до міжнародних наукометричних баз даних Web of Science і (або) Scopus")]
        Стаття_В_Інших_Виданнях_які_включені_до_міжнародних_наукометричних_баз_даних,
        [Display(Name = "Стаття у виданнях, які включені до міжнародних наукометричних баз даних Web of Science, Scopus (Q1, Q2)")]
        Стаття_У_Виданнях_які_включені_до_міжнародних_наукометричних_баз_даних_Q1_Q2,
        [Display(Name = "Стаття у виданнях, які включені до міжнародних наукометричних баз даних Web of Science, Scopus (Q3, Q4, без квартиля)")]
        Стаття_У_Виданнях_які_включені_до_міжнародних_наукометричних_баз_даних_Q3_Q4,
        [Display(Name = "Матеріали конференцій, які індексуються у міжнародних наукометричних баз даних Web of Science, Scopus")]
        Матеріали_Конференцій_які_індексуються_у_міжнародних_наукометричних_баз_даних,
        [Display(Name = "Стаття в іншому закордонному виданні")]
        Стаття_В_Інших_Закордонних_Виданнях,
        [Display(Name = "Стаття у фаховому виданні України")]
        Стаття_В_Фахових_Виданнях_України,
        [Display(Name = "Стаття в іншому виданні України")]
        Стаття_В_Інших_Виданнях_України,
        [Display(Name = "Тези доповіді на міжнародній конференції")]
        Тези_Доповіді_На_Міжнародній_Конференції,
        [Display(Name = "Тези доповіді на вітчизняній конференції")]
        Тези_Доповіді_На_Вітчизняній_Конференції,
        [Display(Name = "Заявка на винахід (корисну модель)")]
        Заявка_на_винахід,
        [Display(Name = "Патент на винахід (корисну модель)")]
        Патент,
        [Display(Name = "Інше")]
        Інше_Наукове_Видання,
    }
}