using System.ComponentModel.DataAnnotations;

namespace SRS.Domain.Enums
{
    public enum PublicationType
    {
        [Display(Name = "Монографія")]
        Монографія,
        [Display(Name = "Розділ монографії")]
        Розділ_монографії,
        [Display(Name = "Підручник")]
        Підручник,
        [Display(Name = "Навчальний посібник")]
        Навчальний_Посібник,
        [Display(Name = "Стаття у виданні, яке має імпакт-фактор")]
        Стаття_В_Виданнях_які_мають_імпакт_фактор,
        [Display(Name = "Стаття в іншому виданні, яке включене до міжнародних наукометричних баз даних Web of Science, Scopus та інших")]
        Стаття_В_Інших_Виданнях_які_включені_до_міжнародних_наукометричних_баз_даних,
        [Display(Name = "Стаття в іншому закордонному виданні")]
        Стаття_В_Інших_Закордонних_Виданнях,
        [Display(Name = "Стаття у фаховому виданні України")]
        Стаття_В_Фахових_Виданнях_України,
        [Display(Name = "Стаття в іншому виданні України")]
        Стаття_В_Інших_Виданнях_України,
        [Display(Name = "Тези доповіді на міжнародній конференції")]
        Тези_Доповіді_На_Міжнародній_Конференції,
        [Display(Name = "Тези доповіді на вітчизняній конференції")]
        Тези_Доповіді_На_Вітчизняній_Конференції,
        [Display(Name = "Заявка на винахід (корисну модель)")]
        Заявка_на_винахід,
        [Display(Name = "Патент на винахід (корисну модель)")]
        Патент,
        [Display(Name = "Інше")]
        Інше_Наукове_Видання,
    }
}